In [36]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from scipy import stats

%matplotlib inline

In [3]:
loan_df = pd.read_csv("data/kiva_loans.csv")
mpi_region_locations_df = pd.read_csv("data/kiva_mpi_region_locations.csv")
loan_theme_ids_df = pd.read_csv("data/loan_theme_ids.csv")
loan_themes_by_region_df = pd.read_csv("data/loan_themes_by_region.csv")

In [4]:
loan_df.head()

,id,funded_amount,loan_amount,activity,sector,use,country_code,country,region,currency,partner_id,posted_time,disbursed_time,funded_time,term_in_months,lender_count,tags,borrower_genders,repayment_interval,date
0,653051,300.0,300.0,Fruits & Vegetables,Food,"To buy seasonal, fresh fruits to sell.",PK,Pakistan,Lahore,PKR,247.0,2014-01-01 06:12:39+00:00,2013-12-17 08:00:00+00:00,2014-01-02 10:06:32+00:00,12.0,12,NaN,female,irregular,2014-01-01
1,653053,575.0,575.0,Rickshaw,Transportation,to repair and maintain the auto rickshaw used ...,PK,Pakistan,Lahore,PKR,247.0,2014-01-01 06:51:08+00:00,2013-12-17 08:00:00+00:00,2014-01-02 09:17:23+00:00,11.0,14,NaN,"female, female",irregular,2014-01-01
2,653068,150.0,150.0,Transportation,Transportation,To repair their old cycle-van and buy another ...,IN,India,Maynaguri,INR,334.0,2014-01-01 09:58:07+00:00,2013-12-17 08:00:00+00:00,2014-01-01 16:01:36+00:00,43.0,6,"user_favorite, user_favorite",female,bullet,2014-01-01
3,653063,200.0,200.0,Embroidery,Arts,to purchase an embroidery machine and a variet...,PK,Pakistan,Lahore,PKR,247.0,2014-01-01 08:03:11+00:00,2013-12-24 08:00:00+00:00,2014-01-01 13:00:00+00:00,11.0,8,NaN,female,irregular,2014-01-01
4,653084,400.0,400.0,Milk Sales,Food,to purchase one buffalo.,PK,Pakistan,Abdul Hakeem,PKR,245.0,2014-01-01 11:53:19+00:00,2013-12-17 08:00:00+00:00,2014-01-01 19:18:51+00:00,14.0,16,NaN,female,monthly,2014-01-01

In [5]:
mpi_region_locations_df.head()

,LocationName,ISO,country,region,world_region,MPI,geo,lat,lon
0,"Badakhshan, Afghanistan",AFG,Afghanistan,Badakhshan,South Asia,0.387,"(36.7347725, 70.81199529999999)",36.734772,70.811995
1,"Badghis, Afghanistan",AFG,Afghanistan,Badghis,South Asia,0.466,"(35.1671339, 63.7695384)",35.167134,63.769538
2,"Baghlan, Afghanistan",AFG,Afghanistan,Baghlan,South Asia,0.300,"(35.8042947, 69.2877535)",35.804295,69.287754
3,"Balkh, Afghanistan",AFG,Afghanistan,Balkh,South Asia,0.301,"(36.7550603, 66.8975372)",36.755060,66.897537
4,"Bamyan, Afghanistan",AFG,Afghanistan,Bamyan,South Asia,0.325,"(34.8100067, 67.8212104)",34.810007,67.821210

In [6]:
loan_theme_ids_df.head()

       id    Loan Theme ID          Loan Theme Type  Partner ID
0  638631  a1050000000skGl                  General       151.0
1  640322  a1050000000skGl                  General       151.0
2  641006  a1050000002X1ij         Higher Education       160.0
3  641019  a1050000002X1ij         Higher Education       160.0
4  641594  a1050000002VbsW  Subsistence Agriculture       336.0

In [7]:
loan_themes_by_region_df.head()

,Partner ID,Field Partner Name,sector,Loan Theme ID,Loan Theme Type,country,forkiva,region,geocode_old,ISO,...,amount,LocationName,geocode,names,geo,lat,lon,mpi_region,mpi_geo,rural_pct
0,9,KREDIT Microfinance Institution,General Financial Inclusion,a1050000000slfi,Higher Education,Cambodia,No,Banteay Meanchey,"(13.75, 103.0)",KHM,...,450,"Banteay Meanchey, Cambodia","[(13.6672596, 102.8975098)]",Banteay Meanchey Province; Cambodia,"(13.6672596, 102.8975098)",13.667260,102.897510,"Banteay Mean Chey, Cambodia","(13.6672596, 102.8975098)",90.0
1,9,KREDIT Microfinance Institution,General Financial Inclusion,a10500000068jPe,Vulnerable Populations,Cambodia,No,Battambang Province,NaN,KHM,...,20275,"Battambang Province, Cambodia","[(13.0286971, 102.989615)]",Battambang Province; Cambodia,"(13.0286971, 102.989615)",13.028697,102.989615,"Banteay Mean Chey, Cambodia","(13.6672596, 102.8975098)",90.0
2,9,KREDIT Microfinance Institution,General Financial Inclusion,a1050000000slfi,Higher Education,Cambodia,No,Battambang Province,NaN,KHM,...,9150,"Battambang Province, Cambodia","[(13.0286971, 102.989615)]",Battambang Province; Cambodia,"(13.0286971, 102.989615)",13.028697,102.989615,"Banteay Mean Chey, Cambodia","(13.6672596, 102.8975098)",90.0
3,9,KREDIT Microfinance Institution,General Financial Inclusion,a10500000068jPe,Vulnerable Populations,Cambodia,No,Kampong Cham Province,"(12.0, 105.5)",KHM,...,604950,"Kampong Cham Province, Cambodia","[(12.0982918, 105.3131185)]",Kampong Cham Province; Cambodia,"(12.0982918, 105.3131185)",12.098292,105.313119,"Kampong Cham, Cambodia","(11.9924294, 105.4645408)",90.0
4,9,KREDIT Microfinance Institution,General Financial Inclusion,a1050000002X1Uu,Sanitation,Cambodia,No,Kampong Cham Province,"(12.0, 105.5)",KHM,...,275,"Kampong Cham Province, Cambodia","[(12.0982918, 105.3131185)]",Kampong Cham Province; Cambodia,"(12.0982918, 105.3131185)",12.098292,105.313119,"Kampong Cham, Cambodia","(11.9924294, 105.4645408)",90.0

#### Statistical Summary of the data

In [8]:
loan_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 671205 entries, 0 to 671204
Data columns (total 20 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  671205 non-null  int64
 1   funded_amount       671205 non-null  float64
 2   loan_amount         671205 non-null  float64
 3   activity            671205 non-null  object
 4   sector              671205 non-null  object
 5   use                 666973 non-null  object
 6   country_code        671197 non-null  object
 7   country             671205 non-null  object
 8   region              614405 non-null  object
 9   currency            671205 non-null  object
 10  partner_id          657698 non-null  float64
 11  posted_time         671205 non-null  object
 12  disbursed_time      668809 non-null  object
 13  funded_time         622874 non-null  object
 14  term_in_months      671205 non-null  float64
 15  lender_count        671205 non-null  int64
 16  tags                499789 non-null  object
 17  borrower_genders    666984 non-null  object
 18  repayment_interval  671205 non-null  object
 19  date                671205 non-null  object
dtypes: float64(4), int64(2), object(14)
memory usage: 102.4+ MB

In [9]:
loan_df.describe()

,id,funded_amount,loan_amount,partner_id,term_in_months,lender_count
count,6.712050e+05,671205.000000,671205.000000,657698.000000,671205.000000,671205.000000
mean,9.932486e+05,785.995061,842.397107,178.199616,13.739022,20.590922
std,1.966113e+05,1130.398941,1198.660073,94.247581,8.598919,28.459551
min,6.530470e+05,0.000000,25.000000,9.000000,1.000000,0.000000
25%,8.230720e+05,250.000000,275.000000,126.000000,8.000000,7.000000
50%,9.927800e+05,450.000000,500.000000,145.000000,13.000000,13.000000
75%,1.163653e+06,900.000000,1000.000000,204.000000,14.000000,24.000000
max,1.340339e+06,100000.000000,100000.000000,536.000000,158.000000,2986.000000

In [10]:
loan_df.describe(include=["O"])

,activity,sector,use,country_code,country,region,currency,posted_time,disbursed_time,funded_time,tags,borrower_genders,repayment_interval,date
count,671205,671205,666973,671197,671205,614405,671205,671205,668809,622874,499789,666984,671205,671205
unique,163,15,424912,86,87,12695,67,667399,5719,498007,86719,11298,4,1298
top,Farming,Agriculture,to buy a water filter to provide safe drinking...,PH,Philippines,Kaduna,PHP,2017-05-15 00:00:00+00:00,2017-02-01 08:00:00+00:00,2016-09-21 13:03:24+00:00,user_favorite,female,monthly,2017-03-20
freq,72955,180302,5217,160441,160441,10000,160440,25,2800,33,27088,426502,342717,1308

### Data Preparation

#### Check for Null Values

In [11]:
loan_df.isna().sum()

id                         0
funded_amount              0
loan_amount                0
activity                   0
sector                     0
use                     4232
country_code               8
country                    0
region                 56800
currency                   0
partner_id             13507
posted_time                0
disbursed_time          2396
funded_time            48331
term_in_months             0
lender_count               0
tags                  171416
borrower_genders        4221
repayment_interval         0
date                       0
dtype: int64

> The dataset is quite huge, therefore I need to remove the null values.

In [28]:
loan_df.dropna(inplace=True)
loan_df.isna().sum()

id                    0
funded_amount         0
loan_amount           0
activity              0
sector                0
use                   0
country_code          0
country               0
region                0
currency              0
partner_id            0
posted_time           0
disbursed_time        0
funded_time           0
term_in_months        0
lender_count          0
tags                  0
borrower_genders      0
repayment_interval    0
date                  0
clean_gender          0
dtype: int64

In [29]:
loan_df.shape

(423081, 21)

In [30]:
mpi_region_locations_df.dropna(inplace=True)
mpi_region_locations_df.isna().sum()

LocationName    0
ISO             0
country         0
region          0
world_region    0
MPI             0
geo             0
lat             0
lon             0
dtype: int64

In [31]:
loan_theme_ids_df.dropna(inplace=True)
loan_theme_ids_df.isna().sum()

id                 0
Loan Theme ID      0
Loan Theme Type    0
Partner ID         0
dtype: int64

In [32]:
loan_themes_by_region_df.dropna(inplace=True)
loan_themes_by_region_df.isna().sum()

Partner ID            0
Field Partner Name    0
sector                0
Loan Theme ID         0
Loan Theme Type       0
country               0
forkiva               0
region                0
geocode_old           0
ISO                   0
number                0
amount                0
LocationName          0
geocode               0
names                 0
geo                   0
lat                   0
lon                   0
mpi_region            0
mpi_geo               0
rural_pct             0
dtype: int64

#### Check for duplicated Values

In [15]:
loan_df.duplicated().sum()

0

In [16]:
mpi_region_locations_df.duplicated().sum()

1763

In [34]:
mpi_region_locations_df.drop_duplicates(inplace=True)
mpi_region_locations_df.duplicated().sum()

0

In [17]:
loan_theme_ids_df.duplicated().sum()

0

In [18]:
loan_themes_by_region_df.duplicated().sum()

0

#### Unique values

In [19]:
{column: len(loan_df[column].unique()) for column in loan_df.columns} ## To show the unigue values For all columns

{'id': 671205,
 'funded_amount': 610,
 'loan_amount': 479,
 'activity': 163,
 'sector': 15,
 'use': 424913,
 'country_code': 87,
 'country': 87,
 'region': 12696,
 'currency': 67,
 'partner_id': 367,
 'posted_time': 667399,
 'disbursed_time': 5720,
 'funded_time': 498008,
 'term_in_months': 148,
 'lender_count': 503,
 'tags': 86720,
 'borrower_genders': 11299,
 'repayment_interval': 4,
 'date': 1298}

In [20]:
{column: len(mpi_region_locations_df[column].unique()) for column in mpi_region_locations_df.columns} ## To show the unigue values For all columns

{'LocationName': 985,
 'ISO': 103,
 'country': 103,
 'region': 929,
 'world_region': 7,
 'MPI': 453,
 'geo': 881,
 'lat': 881,
 'lon': 788}

In [21]:
{column: len(loan_theme_ids_df[column].unique()) for column in loan_theme_ids_df.columns} ## To show the unigue values For all columns

{'id': 779092, 'Loan Theme ID': 957, 'Loan Theme Type': 204, 'Partner ID': 385}

In [22]:
{column: len(loan_themes_by_region_df[column].unique()) for column in loan_themes_by_region_df.columns} ## To show the unigue values For all columns

{'Partner ID': 302,
 'Field Partner Name': 302,
 'sector': 11,
 'Loan Theme ID': 718,
 'Loan Theme Type': 170,
 'country': 79,
 'forkiva': 2,
 'region': 9526,
 'geocode_old': 341,
 'ISO': 78,
 'number': 638,
 'amount': 2532,
 'LocationName': 9561,
 'geocode': 6558,
 'names': 6276,
 'geo': 6558,
 'lat': 6551,
 'lon': 6016,
 'mpi_region': 393,
 'mpi_geo': 336,
 'rural_pct': 57}

#### Clean up the gender column

In [25]:
# Clean up the gender column
def clean_gender(gender):
    gender = str(gender)
    if gender.startswith('f'):
        gender = 'female'
    else:
        gender = 'male'
    return gender

In [35]:
loan_df['clean_gender'] = loan_df['borrower_genders'].apply(clean_gender)
loan_df.head(3)

,id,funded_amount,loan_amount,activity,sector,use,country_code,country,region,currency,...,posted_time,disbursed_time,funded_time,term_in_months,lender_count,tags,borrower_genders,repayment_interval,date,clean_gender
2,653068,150.0,150.0,Transportation,Transportation,To repair their old cycle-van and buy another ...,IN,India,Maynaguri,INR,...,2014-01-01 09:58:07+00:00,2013-12-17 08:00:00+00:00,2014-01-01 16:01:36+00:00,43.0,6,"user_favorite, user_favorite",female,bullet,2014-01-01,female
6,653067,200.0,200.0,Dairy,Agriculture,To purchase a dairy cow and start a milk produ...,IN,India,Maynaguri,INR,...,2014-01-01 09:51:02+00:00,2013-12-16 08:00:00+00:00,2014-01-01 17:18:09+00:00,43.0,8,"user_favorite, user_favorite",female,bullet,2014-01-01,female
7,653078,400.0,400.0,Beauty Salon,Services,to buy more hair and skin care products.,PK,Pakistan,Ellahabad,PKR,...,2014-01-01 11:46:01+00:00,2013-12-20 08:00:00+00:00,2014-01-10 18:18:44+00:00,14.0,8,"#Elderly, #Woman Owned Biz",female,monthly,2014-01-01,female

#### Remove Outliers

In [ ]:
num_cols = loan_df.select_dtypes(['int64', 'float64'])
num_cols

In [ ]:
for col in num_cols:
    z = np.abs(stats.zscore(loan_df[col]))

    # Identify outliers as variables with a z-score greater than 3
    threshold = 3
    outliers = loan_df[z > threshold]

print(outliers)

In [ ]:
# Drop outliers
loan_df = loan_df.drop(outliers.index)
loan_df.head()

### Exploratory Data Analysis

#### Disbursment Rate

In [23]:
disbursment_rate =

11298